{
  "2017": {
    "Q0": "Select your gender identity.",
    "Q1": "Select the country you currently live in.",
    "Q2": "What's your age?",
    "Q3": "What's your current employment status?",
    "Q4": "Are you currently enrolled as a student at a degree granting school?",
    "Q5": "Are you currently focused on learning data science skills either formally or informally?",
    "Q6": "What's your motivation for being a Kaggle user?",
    "Q7": "Do you write code to analyze data in your current job, freelance contracts, or most recent job if retired?",
    "Q8": "Are you actively looking to switch careers to data science?",
    "Q9": "Select the option that's most similar to your current job/professional title (or most recent title if retired).",
    "Q10": "How adequately do you feel your title describes what you do (or what you did if retired)?",
    "Q11": "Which of the following describe your current employer (or most recent employer if retired)?",
    "Q12": "Which tool or technology are you most excited about learning in the next year? (Select one option)",
    "Q13": "Which ML/DS method are you most excited about learning in the next year?",
    "Q14": "What programming language would you recommend a new data scientist learn first?",
    "Q15": "Where do you find public datasets to practice data science skills?",
    "Q16": "What is your biggest challenge with the public datasets you find for personal projects?",
    "Q17": "What platforms & resources have you used to continue learning data science skills?",
    "Q18": "How useful did you find these platforms & resources for learning data science skills?",
    "Q19": "What are your top 3 favorite data science blogs/podcasts/newsletters?",
    "Q20": "How long have you been learning data science?",
    "Q21": "How important do you think the below skills or certifications are in getting a data science job?",
    "Q22": "On which online platforms have you begun or completed data science courses?",
    "Q23": "Which computing hardware do you use for your personal ML/DS projects?",
    "Q24": "On average, how many hours a week do you spend studying data science?",
    "Q25": "What's the most important way you can prove your knowledge of ML/DS?",
    "Q26": "What's the most impactful machine learning algorithm you've ever deployed?",
    "Q27": "If given the necessary resources and time, what problem would you personally choose to tackle with machine learning?",
    "Q28": "Do you currently consider yourself a data scientist? - S",
    "Q29": "Which level of formal education have you attained?",
    "Q30": "Which best describes your undergraduate major?",
    "Q31": "How long have you been writing code to analyze data?",
    "Q32": "Select all other job titles you've held in the past 10 years?",
    "Q33": "How did you first start your machine learning / data science training?",
    "Q34": "What percentage of your current machine learning / data science training falls under each category?",
    "Q35": "In which areas of machine learning do you consider yourself competent?",
    "Q36": "In which machine learning techniques do you consider yourself competent?",
    "Q37": "What's the highest level of education completed by either of your parents?",
    "Q38": "Which industry is your current employer/contract in (or most recent employer if retired)?",
    "Q39": "How many employees work at your current or most recent company?",
    "Q40": "How has the size of your organization's ML/DS staff changed over the past year?",
    "Q41": "How many years has your organization been utilizing advanced analytics/data science?",
    "Q42": "How did you find your current job? - S",
    "Q43": "How important was your formal education or degree to your career success analyzing data?",
    "Q44": "What is the primary function of your role?",
    "Q45": "At work, which computing hardware do you use for ML/DS projects?",
    "Q46": "At work, which kind of data do you typically work with?",
    "Q47": "At work, how often do the models you build get put into production?",
    "Q48": "At work, which libraries do you typically use?",
    "Q49": "Of the models you've trained at work, what is the typical size of datasets used?",
    "Q50": "At work, which algorithms/analytic methods do you typically use?",
    "Q51": "For work, which data science/analytics tools, technologies, and languages have you used in the past year?",
    "Q52": "At work, how often did you use the following data science/analytics tools, technologies, and languages this past year? - Amazon",
    "Q53": "At work, how often did you use the following data science/analytics tools, technologies, and languages this past year?",
    "Q54": "At work, which data science methods do you use?",
    "Q55": "At work, how often do you use the following data science methods? - A",
    "Q56": "At work, how often do you use the following data science methods?",
    "Q57": "At work, on average, what percentage of your time is devoted to:",
    "Q58": "At which level do you understand the mathematics behind the algorithms you use at work?",
    "Q59": "At work, which barriers or challenges have you faced this past year?",
    "Q60": "At work, how often did you experience these barriers or challenges within the past year?",
    "Q61": "At work, what proportion of your analytics projects incorporate data visualization?",
    "Q62": "At work, to what degree does your team use interval versus external resources for data science projects?",
    "Q63": "At work, where does the data scientist team sit within the organization?",
    "Q64": "At work, in addition to proprietary data, what third party and public datasets do you work with?",
    "Q65": "What is your biggest challenge for working with your source data?",
    "Q66": "At work, which of these data storage models do you typically use?",
    "Q67": "At work, which tools do you use to share source data?",
    "Q68": "At work, which tools do you use to share code?",
    "Q69": "How often do you work remotely?",
    "Q70": "What is your current total yearly compensation (salary + bonus)?",
    "Q71": "How has your salary/compensation changed in the past 3 years?",
    "Q72": "On a scale from 0 (Highly Dissatisfied) - 10 (Highly Satisfied), how satisfied are you with your current job?",
    "Q73": "Which resource has been the best for finding data science job openings?",
    "Q74": "How many hours per week have you typically spend looking for a data science job?",
    "Q75": "How are you assessing potential job opportunities?"
  },
  "2018": {
    "Q1": "What is your gender?",
    "Q2": "What is your age",
    "Q3": "In which country do you currently reside?",
    "Q4": "What is the highest level of formal education that you have attained or plan to attain within the next 2 years?",
    "Q5": "Which best describes your undergraduate major?",
    "Q6": "Select the title most similar to your current role (or most recent title if retired)",
    "Q7": "In what industry is your current employer/contract (or your most recent employer if retired)?",
    "Q8": "How many years of experience do you have in your current role?",
    "Q9": "What is your current yearly compensation (approximate $USD)?",
    "Q10": "Does your current employer incorporate machine learning methods into their business?",
    "Q11": "Select any activities that make up an important part of your role at work:",
    "Q12": "What is the primary tool that you use at work or school to analyze data?",
    "Q13": "Which of the following integrated development environments (IDE's) have you used at work or school in the last 5 years?",
    "Q14": "Which of the following hosted notebooks have you used at work or school in the last 5 years?",
    "Q15": "Which of the following cloud computing services have you used at work or school in the last 5 years?",
    "Q16": "What programming languages do you use on a regular basis?",
    "Q17": "What specific programming language do you use most often?",
    "Q18": "What programming language would you recommend an aspiring data scientist to learn first?",
    "Q19": "What machine learning frameworks have you used in the past 5 years?",
    "Q20": "Of the choices that you selected in the previous question, which ML library have you used the most?",
    "Q21": "What data visualization libraries or tools have you used in the past 5 years?",
    "Q22": "Of the choices that you selected in the previous question, which specific data visualization library or tool have you used the most?",
    "Q23": "Approximately what percent of your time at work or school is spent actively coding?",
    "Q24": "How long have you been writing code to analyze data?",
    "Q25": "For how many years have you used machine learning methods",
    "Q26": "Do you consider yourself to be a data scientist?",
    "Q27": "Which of the following cloud computing products have you used at work or school in the last 5 years",
    "Q28": "Which of the following machine learning products have you used at work or school in the last 5 years?",
    "Q29": "Which of the following relational database products have you used at work or school in the last 5 years?",
    "Q30": "Which of the following big data and analytics products have you used at work or school in the last 5 years?",
    "Q31": "Which types of data do you currently interact with most often at work or school?",
    "Q32": "What is the type of data that you currently interact with most often at work or school?",
    "Q33": "Where do you find public datasets?",
    "Q34": "During a typical data science project at work or school, approximately what proportion of your time is devoted to the following?",
    "Q35": "What percentage of your current machine learning/data science training falls under each category?",
    "Q36": "On which online platforms have you begun or completed data science courses?",
    "Q37": "On which online platform have you spent the most amount of time?",
    "Q38": "Who/what are your favorite media sources that report on data science topics?",
    "Q39": "How do you perceive the quality of online learning platforms and in-person bootcamps as compared to the quality of the education provided by traditional brick and mortar institutions? - Online learning platforms and MOOCs:",
    "Q40": "Which better demonstrates expertise in data science: academic achievements or independent projects? - Your views:",
    "Q41": "How do you perceive the importance of the following topics? - Fairness and bias in ML algorithms:",
    "Q42": "What metrics do you or your organization use to determine whether or not your models were successful?",
    "Q43": "Approximately what percent of your data projects involved exploring unfair bias in the dataset and/or algorithm?",
    "Q44": "What do you find most difficult about ensuring that your algorithms are fair and unbiased?",
    "Q45": "In what circumstances would you explore model insights and interpret your model's predictions?",
    "Q46": "Approximately what percent of your data projects involve exploring model insights?",
    "Q47": "What methods do you prefer for explaining and/or interpreting decisions that are made by ML models?",
    "Q48": "Do you consider ML models to be \"black boxes\" with outputs that are difficult or impossible to explain?",
    "Q49": "What tools and methods do you use to make your work easy to reproduce?",
    "Q50": "What barriers prevent you from making your work even easier to reuse and reproduce?"
  },
  "2019": {
    "Q1": "What is your age",
    "Q2": "What is your gender?",
    "Q3": "In which country do you currently reside?",
    "Q4": "What is the highest level of formal education that you have attained or plan to attain within the next 2 years?",
    "Q5": "Select the title most similar to your current role (or most recent title if retired)",
    "Q6": "What is the size of the company where you are employed?",
    "Q7": "Approximately how many individuals are responsible for data science workloads at your place of business?",
    "Q8": "Does your current employer incorporate machine learning methods into their business?",
    "Q9": "Select any activities that make up an important part of your role at work:",
    "Q10": "What is your current yearly compensation (approximate $USD)?",
    "Q11": "Approximately how much money have you spent on machine learning and/or cloud computing products at your work in the past 5 years?",
    "Q12": "Who/what are your favorite media sources that report on data science topics?",
    "Q13": "On which platforms have you begun or completed data science courses?",
    "Q14": "What is the primary tool that you use at work or school to analyze data?",
    "Q15": "How long have you been writing code to analyze data",
    "Q16": "Which of the following integrated development environments (IDE's) do you use on a regular basis?",
    "Q17": "Which of the following hosted notebook products do you use on a regular basis?",
    "Q18": "What programming languages do you use on a regular basis?",
    "Q19": "What programming language would you recommend an aspiring data scientist to learn first?",
    "Q20": "What data visualization libraries or tools do you use on a regular basis?",
    "Q21": "Which types of specialized hardware do you use on a regular basis?",
    "Q22": "Have you ever used a TPU (tensor processing unit)?",
    "Q23": "For how many years have you used machine learning methods?",
    "Q24": "Which of the following ML algorithms do you use on a regular basis?",
    "Q25": "Which categories of ML tools do you use on a regular basis?",
    "Q26": "Which categories of computer vision methods do you use on a regular basis?",
    "Q27": "Which of the following natural language processing (NLP) methods do you use on a regular basis?",
    "Q28": "Which of the following machine learning frameworks do you use on a regular basis?",
    "Q29": "Which of the following cloud computing platforms do you use on a regular basis?",
    "Q30": "Which specific cloud computing products do you use on a regular basis?",
    "Q31": "Which specific big data / analytics products do you use on a regular basis?",
    "Q32": "Which of the following machine learning products do you use on a regular basis?",
    "Q33": "Which automated machine learning tools (or partial AutoML tools) do you use on a regular basis?",
    "Q34": "Which of the following relational database products do you use on a regular basis?"
  },
  "2020": {
    "Q1": "What is your age",
    "Q2": "What is your gender?",
    "Q3": "In which country do you currently reside?",
    "Q4": "What is the highest level of formal education that you have attained or plan to attain within the next 2 years?",
    "Q5": "Select the title most similar to your current role (or most recent title if retired)",
    "Q6": "For how many years have you been writing code and/or programming?",
    "Q7": "What programming languages do you use on a regular basis?",
    "Q8": "What programming language would you recommend an aspiring data scientist to learn first?",
    "Q9": "Which of the following integrated development environments (IDE's) do you use on a regular basis?",
    "Q10": "Which of the following hosted notebook products do you use on a regular basis?",
    "Q11": "What type of computing platform do you use most often for your data science projects?",
    "Q12": "Which types of specialized hardware do you use on a regular basis?",
    "Q13": "Approximately how many times have you used a TPU (tensor processing unit)?",
    "Q14": "What data visualization libraries or tools do you use on a regular basis?",
    "Q15": "For how many years have you used machine learning methods?",
    "Q16": "Which of the following machine learning frameworks do you use on a regular basis?",
    "Q17": "Which of the following ML algorithms do you use on a regular basis?",
    "Q18": "Which categories of computer vision methods do you use on a regular basis?",
    "Q19": "Which of the following natural language processing (NLP) methods do you use on a regular basis?",
    "Q20": "What is the size of the company where you are employed?",
    "Q21": "Approximately how many individuals are responsible for data science workloads at your place of business?",
    "Q22": "Does your current employer incorporate machine learning methods into their business?",
    "Q23": "Select any activities that make up an important part of your role at work:",
    "Q24": "What is your current yearly compensation (approximate $USD)?",
    "Q25": "Approximately how much money have you (or your team) spent on machine learning and/or cloud computing services at home (or at work) in the past 5 years (approximate $USD)?",
    "Q26": "Which of the following cloud computing platforms do you use on a regular basis?",
    "Q27": "Do you use any of the following cloud computing products on a regular basis?",
    "Q28": "Do you use any of the following machine learning products on a regular basis?",
    "Q29": "Which of the following big data products (relational databases, data warehouses, data lakes, or similar) do you use on a regular basis?",
    "Q30": "Which of the following big data products (relational database, data warehouse, data lake, or similar) do you use most often?",
    "Q31": "Which of the following business intelligence tools do you use on a regular basis?",
    "Q32": "Which of the following business intelligence tools do you use most often?",
    "Q33": "Do you use any automated machine learning tools (or partial AutoML tools) on a regular basis?",
    "Q34": "Which of the following automated machine learning tools (or partial AutoML tools) do you use on a regular basis?",
    "Q35": "Do you use any tools to help manage machine learning experiments?",
    "Q36": "Where do you publicly share or deploy your data analysis or machine learning applications?",
    "Q37": "On which platforms have you begun or completed data science courses?",
    "Q38": "What is the primary tool that you use at work or school to analyze data?",
    "Q39": "Who/what are your favorite media sources that report on data science topics?"
  },
  "2021": {
    "Q1": "What is your age",
    "Q2": "What is your gender?",
    "Q3": "In which country do you currently reside?",
    "Q4": "What is the highest level of formal education that you have attained or plan to attain within the next 2 years?",
    "Q5": "Select the title most similar to your current role",
    "Q6": "For how many years have you been writing code and/or programming?",
    "Q7": "What programming languages do you use on a regular basis?",
    "Q8": "What programming language would you recommend an aspiring data scientist to learn first?",
    "Q9": "Which of the following integrated development environments (IDE's) do you use on a regular basis?",
    "Q10": "Which of the following hosted notebook products do you use on a regular basis?",
    "Q11": "What type of computing platform do you use most often for your data science projects?",
    "Q12": "Which types of specialized hardware do you use on a regular basis?",
    "Q13": "Approximately how many times have you used a TPU (tensor processing unit)?",
    "Q14": "What data visualization libraries or tools do you use on a regular basis?",
    "Q15": "For how many years have you used machine learning methods?",
    "Q16": "Which of the following machine learning frameworks do you use on a regular basis?",
    "Q17": "Which of the following ML algorithms do you use on a regular basis?",
    "Q18": "Which categories of computer vision methods do you use on a regular basis?",
    "Q19": "Which of the following natural language processing (NLP) methods do you use on a regular basis?",
    "Q20": "In what industry is your current employer/contract (or your most recent employer if retired)",
    "Q21": "What is the size of the company where you are employed?",
    "Q22": "Approximately how many individuals are responsible for data science workloads at your place of business?",
    "Q23": "Does your current employer incorporate machine learning methods into their business?",
    "Q24": "Select any activities that make up an important part of your role at work:",
    "Q25": "What is your current yearly compensation (approximate $USD)?",
    "Q26": "Approximately how much money have you (or your team) spent on machine learning and/or cloud computing services at home (or at work) in the past 5 years (approximate $USD)?",
    "Q27": "Which of the following cloud computing platforms do you use on a regular basis?",
    "Q28": "Of the cloud platforms that you are familiar with, which has the best developer experience (most enjoyable to use)?",
    "Q29": "Do you use any of the following cloud computing products on a regular basis?",
    "Q30": "Do you use any of the following data storage products on a regular basis?",
    "Q31": "Do you use any of the following managed machine learning products on a regular basis?",
    "Q32": "Which of the following big data products (relational databases, data warehouses, data lakes, or similar) do you use on a regular basis?",
    "Q33": "Which of the following big data products (relational database, data warehouse, data lake, or similar) do you use most often?",
    "Q34": "Which of the following business intelligence tools do you use on a regular basis?",
    "Q35": "Which of the following business intelligence tools do you use most often?",
    "Q36": "Do you use any automated machine learning tools (or partial AutoML tools) on a regular basis?",
    "Q37": "Which of the following automated machine learning tools (or partial AutoML tools) do you use on a regular basis?",
    "Q38": "Do you use any tools to help manage machine learning experiments?",
    "Q39": "Where do you publicly share your data analysis or machine learning applications?",
    "Q40": "On which platforms have you begun or completed data science courses?",
    "Q41": "What is the primary tool that you use at work or school to analyze data?",
    "Q42": "Who/what are your favorite media sources that report on data science topics? "
  },
  "2022": {
    "Q2": "What is your age",
    "Q3": "What is your gender?",
    "Q4": "In which country do you currently reside?",
    "Q5": "Are you currently a student? (high school, university, or graduate)",
    "Q6": "On which platforms have you begun or completed data science courses?",
    "Q7": "What products or platforms did you find to be most helpful when you first started studying data science?",
    "Q8": "What is the highest level of formal education that you have attained or plan to attain within the next 2 years?",
    "Q9": "Have you ever published any academic research (papers, preprints, conference proceedings, etc)?",
    "Q10": "Did your research make use of machine learning? - Yes, the research made",
    "Q11": "For how many years have you been writing code and/or programming?",
    "Q12": "What programming languages do you use on a regular basis?",
    "Q13": "Which of the following integrated development environments (IDE's) do you use on a regular basis?",
    "Q14": "Do you use any of the following hosted notebook products?",
    "Q15": "Do you use any of the following data visualization libraries on a regular basis?",
    "Q16": "For how many years have you used machine learning methods?",
    "Q17": "Which of the following machine learning frameworks do you use on a regular basis?",
    "Q18": "Which of the following ML algorithms do you use on a regular basis?",
    "Q19": "Which categories of computer vision methods do you use on a regular basis?",
    "Q20": "Which of the following natural language processing (NLP) methods do you use on a regular basis?",
    "Q21": "Do you download pre-trained model weights from any of the following services?",
    "Q22": "Which of the following ML model hubs/repositories do you use most often?",
    "Q23": "Select the title most similar to your current role (or most recent title if retired)",
    "Q24": "In what industry is your current employer/contract (or your most recent employer if retired)",
    "Q25": "What is the size of the company where you are employed?",
    "Q26": "Approximately how many individuals are responsible for data science workloads at your place of business?",
    "Q27": "Does your current employer incorporate machine learning methods into their business?",
    "Q28": "Select any activities that make up an important part of your role at work:",
    "Q29": "What is your current yearly compensation (approximate $USD)?",
    "Q30": "Approximately how much money have you spent on machine learning and/or cloud computing services at home or at work in the past 5 years (approximate $USD)?",
    "Q31": "Which of the following cloud computing platforms do you use?",
    "Q32": "Of the cloud platforms that you are familiar with, which has the best developer experience (most enjoyable to use)?",
    "Q33": "Do you use any of the following cloud computing products?",
    "Q34": "Do you use any of the following data storage products?",
    "Q35": "Do you use any of the following data products (relational databases, data warehouses, data lakes, or similar)?",
    "Q36": "Do you use any of the following business intelligence tools?",
    "Q37": "Do you use any of the following managed machine learning products on a regular basis?",
    "Q38": "Do you use any of the following automated machine learning tools?",
    "Q39": "Do you use any of the following products to serve your machine learning models?",
    "Q40": "Do you use any tools to help monitor your machine learning models and/or experiments?",
    "Q41": "Do you use any of the following responsible or ethical AI products in your machine learning practices?",
    "Q42": "Do you use any of the following types of specialized hardware when training machine learning models?",
    "Q43": "Approximately how many times have you used a TPU (tensor processing unit)?",
    "Q44": "Who/what are your favorite media sources that report on data science topics?"
  }
}
